README.md

# Table of Contents

1.  [Instructions for execution of code](#org5a81f76)



<a id="org5a81f76"></a>

# Instructions for execution of code

Code in `lab2.py` takes arguments to customize optimizers, workers, and other helpful arguments for the model and execution. In order to run the code for each exercise, use the following (with the appropriate `C1` through `C7`) command **from the root directory**:

    sbatch sbatch/C1.sh

Also note, C5 has two files `C5_1.sh` and `C5_2.sh` for the GPU and CPU-only nodes.

If you want to run all of the code from `C1` to `C7`, then use the following:

    bash sbatch/run_all.sh

